test/request-response-samples/UpdateProfile__correct_namespaces_for_elements_with_base_ignorednamespaces/request.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"  xmlns:tns="http://www.bigdatacollect.or" xmlns:c="http://www.bigdatacollect.or/Common/Types" xmlns:n="http://www.bigdatacollect.or/Name/Types"><soap:Body><n:UpdateProfileRequest xmlns:n="http://www.bigdatacollect.or/Name/Types" xmlns="http://www.bigdatacollect.or/Name/Types"><Profile><IDs><UniqueID source="TESTSOURCE">100</UniqueID></IDs><Addresses><NameAddress><AddressLine>Another Address</AddressLine></NameAddress><NameAddress><AddressLine>My Address</AddressLine></NameAddress></Addresses><Phones><NamePhone primary="true"><PhoneData><PhoneNumber>123</PhoneNumber></PhoneData></NamePhone><NamePhone primary="false"><PhoneData><PhoneNumber>456</PhoneNumber></PhoneData></NamePhone></Phones></Profile></n:UpdateProfileRequest></soap:Body></soap:Envelope>